// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
/*
void RePlay(int a)
{
    Console.Write(a + " ");
    if(a > 1) RePlay(a - 1);
}
RePlay(8);
*/
// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30
/*
int SumOfAll(int a, int b)
{   
    
    if(b > a) return b += SumOfAll(a, b-1);
    if(a > b) return b +=  SumOfAll(a, b + 1);
    return a;
}
System.Console.Write(SumOfAll(1, 15));
*/

// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29

//Нашёл формулы, но так и не понял как вообще это работает и что делается :D
int Akkerman(int n, int m)
{
    if (n == 0) return m + 1;
    if (n != 0 && m == 0) return Akkerman(n - 1, 1);
    if (n > 0 && m > 0) return Akkerman(n - 1, Akkerman(n, m - 1));
    return Akkerman(n,m);
}
    Console.WriteLine(Akkerman(2, 2));